jmeter.log
2020-03-11 12:41:53,969 INFO o.a.j.u.JMeterUtils: Setting Locale to en_EN
2020-03-11 12:41:54,008 INFO o.a.j.JMeter: Loading user properties from: C:\apache-jmeter-5.0\bin\user.properties
2020-03-11 12:41:54,009 INFO o.a.j.JMeter: Loading system properties from: C:\apache-jmeter-5.0\bin\system.properties
2020-03-11 12:41:54,010 INFO o.a.j.JMeter: Setting JMeter property: usertype=ASB_SI
2020-03-11 12:41:54,010 INFO o.a.j.JMeter: Setting JMeter property: users=1
2020-03-11 12:41:54,010 INFO o.a.j.JMeter: Setting JMeter property: ramp=0
2020-03-11 12:41:54,011 INFO o.a.j.JMeter: Setting JMeter property: duration=0
2020-03-11 12:41:54,021 INFO o.a.j.JMeter: Copyright (c) 1998-2018 The Apache Software Foundation
2020-03-11 12:41:54,021 INFO o.a.j.JMeter: Version 5.0 r1840935
2020-03-11 12:41:54,021 INFO o.a.j.JMeter: java.version=10.0.1
2020-03-11 12:41:54,021 INFO o.a.j.JMeter: java.vm.name=Java HotSpot(TM) 64-Bit Server VM
2020-03-11 12:41:54,021 INFO o.a.j.JMeter: os.name=Windows 7
2020-03-11 12:41:54,021 INFO o.a.j.JMeter: os.arch=amd64
2020-03-11 12:41:54,021 INFO o.a.j.JMeter: os.version=6.1
2020-03-11 12:41:54,022 INFO o.a.j.JMeter: file.encoding=Cp1252
2020-03-11 12:41:54,022 INFO o.a.j.JMeter: Max memory     =2147483648
2020-03-11 12:41:54,022 INFO o.a.j.JMeter: Available Processors =2
2020-03-11 12:41:54,031 INFO o.a.j.JMeter: Default Locale=English (EN)
2020-03-11 12:41:54,032 INFO o.a.j.JMeter: JMeter  Locale=English (EN)
2020-03-11 12:41:54,032 INFO o.a.j.JMeter: JMeterHome=C:\apache-jmeter-5.0
2020-03-11 12:41:54,032 INFO o.a.j.JMeter: user.dir  =C:\Users\DEV.WeiH\Desktop\Performance_Testing
2020-03-11 12:41:54,033 INFO o.a.j.JMeter: PWD       =C:\Users\DEV.WeiH\Desktop\Performance_Testing
2020-03-11 12:41:54,040 INFO o.a.j.JMeter: IP: 172.26.7.172 Name: VSD3223 FullName: VSD3223.sov.asbgroup.co.nz
2020-03-11 12:41:54,040 INFO o.a.j.JMeter: Set http[s].proxyHost: proxy2ndtier.asbbank.co.nz Port: 80
2020-03-11 12:41:54,043 INFO o.a.j.JMeter: Setting property 'jmeter.reportgenerator.outputdir' to:'C:\Users\DEV.WeiH\Desktop\Performance_Testing\Results\UI_MyProtection_FST_SFLogin-ASB_SI_1'
2020-03-11 12:41:54,046 INFO o.a.j.s.FileServer: Default base='C:\Users\DEV.WeiH\Desktop\Performance_Testing'
2020-03-11 12:41:54,050 INFO o.a.j.s.FileServer: Set new base='C:\Users\DEV.WeiH\Desktop\Performance_Testing'
2020-03-11 12:41:54,255 INFO o.a.j.s.SaveService: Testplan (JMX) version: 2.2. Testlog (JTL) version: 2.2
2020-03-11 12:41:54,285 INFO o.a.j.s.SaveService: Using SaveService properties version 5.0
2020-03-11 12:41:54,290 INFO o.a.j.s.SaveService: Using SaveService properties file encoding UTF-8
2020-03-11 12:41:54,299 INFO o.a.j.s.SaveService: Loading file: C:\Users\DEV.WeiH\Desktop\Performance_Testing\UI_MyProtection_FST_SFLogin.jmx
2020-03-11 12:41:54,366 INFO o.a.j.p.h.c.CookieManager: Settings: Delete null: true Check: true Allow variable: true Save: false Prefix: COOKIE_
2020-03-11 12:41:54,371 INFO o.a.j.p.h.c.CacheManager: Will only cache the following methods: [GET]
2020-03-11 12:41:54,399 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/html is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2020-03-11 12:41:54,399 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xhtml+xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2020-03-11 12:41:54,399 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2020-03-11 12:41:54,400 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2020-03-11 12:41:54,400 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/vnd.wap.wml is org.apache.jmeter.protocol.http.parser.RegexpHTMLParser
2020-03-11 12:41:54,400 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/css is org.apache.jmeter.protocol.http.parser.CssParser
2020-03-11 12:41:55,215 INFO o.a.j.JMeter: Creating summariser <summary>
2020-03-11 12:41:55,229 INFO o.a.j.r.d.ReportGenerator: ReportGenerator will use for Parsing the separator: ','
2020-03-11 12:41:55,229 INFO o.a.j.r.d.ReportGenerator: Will generate report at end of test from  results file: C:\Users\DEV.WeiH\Desktop\Performance_Testing\Results\UI_MyProtection_FST_SFLogin-ASB_SI_1.csv
2020-03-11 12:41:55,230 INFO o.a.j.r.d.ReportGenerator: Reading report generator properties from: C:\apache-jmeter-5.0\bin\reportgenerator.properties
2020-03-11 12:41:55,231 INFO o.a.j.r.d.ReportGenerator: Merging with JMeter properties
2020-03-11 12:41:55,237 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.temp_dir' not found, using default value 'temp' instead.
2020-03-11 12:41:55,240 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.apdex_per_transaction' not found, using default value 'null' instead.
2020-03-11 12:41:55,241 INFO o.a.j.r.c.ReportGeneratorConfiguration: apdex_per_transaction : {} is empty, not APDEX per transaction customization
2020-03-11 12:41:55,241 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.sample_filter' not found, using default value 'null' instead.
2020-03-11 12:41:55,241 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.report_title' not found, using default value 'null' instead.
2020-03-11 12:41:55,241 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.start_date' not found, using default value 'null' instead.
2020-03-11 12:41:55,241 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.end_date' not found, using default value 'null' instead.
2020-03-11 12:41:55,242 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.date_format' not found, using default value 'null' instead.
2020-03-11 12:41:55,247 INFO o.a.j.r.c.ReportGeneratorConfiguration: Will use date range start date: null, end date: null
2020-03-11 12:41:55,253 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.totalTPS.exclude_controllers' not found, using default value 'false' instead.
2020-03-11 12:41:55,253 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.activeThreadsOverTime.exclude_controllers' not found, using default value 'false' instead.
2020-03-11 12:41:55,253 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.timeVsThreads.exclude_controllers' not found, using default value 'false' instead.
2020-03-11 12:41:55,253 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.responseTimeDistribution.exclude_controllers' not found, using default value 'false' instead.
2020-03-11 12:41:55,254 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.transactionsPerSecond.exclude_controllers' not found, using default value 'false' instead.
2020-03-11 12:41:55,254 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.responseTimePercentiles.exclude_controllers' not found, using default value 'false' instead.
2020-03-11 12:41:55,254 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.responseTimePercentilesOverTime.exclude_controllers' not found, using default value 'false' instead.
2020-03-11 12:41:55,254 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.responseTimesOverTime.exclude_controllers' not found, using default value 'false' instead.
2020-03-11 12:41:55,255 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.connectTimeOverTime.exclude_controllers' not found, using default value 'false' instead.
2020-03-11 12:41:55,255 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.latenciesOverTime.exclude_controllers' not found, using default value 'false' instead.
2020-03-11 12:41:55,256 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.exporter.html.filters_only_sample_series' not found, using default value 'true' instead.
2020-03-11 12:41:55,256 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.exporter.html.series_filter' not found, using default value '' instead.
2020-03-11 12:41:55,257 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.exporter.html.show_controllers_only' not found, using default value 'false' instead.
2020-03-11 12:41:55,288 INFO o.a.j.e.StandardJMeterEngine: Running the test!
2020-03-11 12:41:55,291 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2020-03-11 12:41:55,291 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2020-03-11 12:41:55,307 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must contain the string: '.functions.'
2020-03-11 12:41:55,307 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must not contain the string: '.gui.'
2020-03-11 12:41:55,987 INFO o.a.j.JMeter: Running test (1583883715987)
2020-03-11 12:41:56,043 INFO o.a.j.e.StandardJMeterEngine: Starting ThreadGroup: 1 : Users
2020-03-11 12:41:56,043 INFO o.a.j.e.StandardJMeterEngine: Starting 1 threads for group Users.
2020-03-11 12:41:56,044 INFO o.a.j.e.StandardJMeterEngine: Thread will continue on error
2020-03-11 12:41:56,044 INFO o.a.j.t.ThreadGroup: Starting thread group... number=1 threads=1 ramp-up=0 perThread=0.0 delayedStart=false
2020-03-11 12:41:56,056 INFO o.a.j.t.ThreadGroup: Started thread group number 1
2020-03-11 12:41:56,057 INFO o.a.j.e.StandardJMeterEngine: All thread groups have been started
2020-03-11 12:41:56,072 INFO o.a.j.t.JMeterThread: Thread started: Users 1-1
2020-03-11 12:41:56,092 INFO o.a.j.p.h.s.HTTPJavaImpl: Maximum connection retries = 0
2020-03-11 12:41:56,094 INFO o.a.j.s.SampleResult: Note: Sample TimeStamps are START times
2020-03-11 12:41:56,094 INFO o.a.j.s.SampleResult: sampleresult.default.encoding is set to ISO-8859-1
2020-03-11 12:41:56,094 INFO o.a.j.s.SampleResult: sampleresult.useNanoTime=true
2020-03-11 12:41:56,094 INFO o.a.j.s.SampleResult: sampleresult.nanoThreadSleep=5000
2020-03-11 12:41:56,098 INFO o.a.j.u.JsseSSLManager: Using default SSL protocol: TLS
2020-03-11 12:41:56,099 INFO o.a.j.u.JsseSSLManager: SSL session context: per-thread
2020-03-11 12:41:57,475 INFO o.a.j.u.SSLManager: JmeterKeyStore Location:  type JKS
2020-03-11 12:41:57,479 INFO o.a.j.u.SSLManager: KeyStore created OK
2020-03-11 12:41:57,480 WARN o.a.j.u.SSLManager: Keystore file not found, loading empty keystore
2020-03-11 12:42:00,033 INFO o.a.j.r.Summariser: summary +      2 in 00:00:04 =    0.5/s Avg:  1916 Min:  1671 Max:  2161 Err:     0 (0.00%) Active: 1 Started: 1 Finished: 0
2020-03-11 12:42:03,642 INFO o.a.j.m.JSR223PreProcessor: ******** T1 Sleep 7 second(s) ********
2020-03-11 12:42:14,411 INFO o.a.j.m.JSR223PreProcessor: ******** T1 Sleep 9 second(s) ********
2020-03-11 12:42:24,628 INFO o.a.j.m.JSR223PreProcessor: ******** T1 Sleep 17 second(s) ********
2020-03-11 12:43:15,840 INFO o.a.j.m.JSR223PreProcessor: ******** T1 Sleep 8 second(s) ********
2020-03-11 12:43:30,005 INFO o.a.j.r.Summariser: summary +     16 in 00:01:30 =    0.2/s Avg:  3021 Min:   162 Max: 20165 Err:     0 (0.00%) Active: 1 Started: 1 Finished: 0
2020-03-11 12:43:30,007 INFO o.a.j.r.Summariser: summary =     18 in 00:01:34 =    0.2/s Avg:  2898 Min:   162 Max: 20165 Err:     0 (0.00%)
2020-03-11 12:43:30,584 INFO o.a.j.m.JSR223PreProcessor: ******** T1 Sleep 9 second(s) ********
2020-03-11 12:43:39,605 INFO o.a.j.t.JMeterThread: Thread is done: Users 1-1
2020-03-11 12:43:39,605 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-1
2020-03-11 12:43:39,607 INFO o.a.j.e.StandardJMeterEngine: Notifying test listeners of end of test
2020-03-11 12:43:39,614 INFO o.a.j.r.Summariser: summary +      2 in 00:00:10 =    0.2/s Avg:   282 Min:   234 Max:   331 Err:     0 (0.00%) Active: 0 Started: 1 Finished: 1
2020-03-11 12:43:39,616 INFO o.a.j.r.Summariser: summary =     20 in 00:01:44 =    0.2/s Avg:  2636 Min:   162 Max: 20165 Err:     0 (0.00%)
2020-03-11 12:43:39,617 INFO o.a.j.JMeter: Generating Dashboard
2020-03-11 12:43:39,617 INFO o.a.j.r.d.ReportGenerator: Flushing result collector before report Generation
2020-03-11 12:43:39,632 INFO o.a.j.r.p.NormalizerSampleConsumer: Using format, 'ms', to parse timeStamp field
2020-03-11 12:43:39,779 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.AggregateConsumer#stopProducing(): beginDate produced 0 samples
2020-03-11 12:43:39,780 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.AggregateConsumer#stopProducing(): endDate produced 0 samples
2020-03-11 12:43:39,782 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.ApdexSummaryConsumer#stopProducing(): apdexSummary produced 0 samples
2020-03-11 12:43:39,782 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.RequestsSummaryConsumer#stopProducing(): requestsSummary produced 0 samples
2020-03-11 12:43:39,789 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.StatisticsSummaryConsumer#stopProducing(): statisticsSummary produced 0 samples
2020-03-11 12:43:39,794 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.Top5ErrorsBySamplerConsumer#stopProducing(): top5ErrorsBySampler produced 0 samples
2020-03-11 12:43:39,794 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.ErrorsSummaryConsumer#stopProducing(): errorsSummary produced 0 samples
2020-03-11 12:43:39,794 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.HitsPerSecondGraphConsumer#stopProducing(): hitsPerSecond produced 0 samples
2020-03-11 12:43:39,835 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.LatencyVSRequestGraphConsumer#stopProducing(): latencyVsRequest produced 0 samples
2020-03-11 12:43:39,835 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.SyntheticResponseTimeDistributionGraphConsumer#stopProducing(): syntheticResponseTimeDistribution produced 0 samples
2020-03-11 12:43:39,836 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.BytesThroughputGraphConsumer#stopProducing(): bytesThroughputOverTime produced 0 samples
2020-03-11 12:43:39,836 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.CodesPerSecondGraphConsumer#stopProducing(): codesPerSecond produced 0 samples
2020-03-11 12:43:39,848 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ResponseTimeVSRequestGraphConsumer#stopProducing(): responseTimeVsRequest produced 0 samples
2020-03-11 12:43:39,849 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.FilterConsumer#stopProducing(): startIntervalControlerFilter produced 189 samples
2020-03-11 12:43:39,849 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.TotalTPSGraphConsumer#stopProducing(): totalTPS produced 0 samples
2020-03-11 12:43:39,849 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ActiveThreadsGraphConsumer#stopProducing(): activeThreadsOverTime produced 0 samples
2020-03-11 12:43:39,849 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.TimeVSThreadGraphConsumer#stopProducing(): timeVsThreads produced 0 samples
2020-03-11 12:43:39,854 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ResponseTimeDistributionGraphConsumer#stopProducing(): responseTimeDistribution produced 0 samples
2020-03-11 12:43:39,854 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.TransactionsPerSecondGraphConsumer#stopProducing(): transactionsPerSecond produced 0 samples
2020-03-11 12:43:39,855 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ResponseTimePercentilesGraphConsumer#stopProducing(): responseTimePercentiles produced 0 samples
2020-03-11 12:43:39,884 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ResponseTimePercentilesOverTimeGraphConsumer#stopProducing(): responseTimePercentilesOverTime produced 0 samples
2020-03-11 12:43:39,884 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ResponseTimeOverTimeGraphConsumer#stopProducing(): responseTimesOverTime produced 0 samples
2020-03-11 12:43:39,885 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ConnectTimeOverTimeGraphConsumer#stopProducing(): connectTimeOverTime produced 0 samples
2020-03-11 12:43:39,889 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.LatencyOverTimeGraphConsumer#stopProducing(): latenciesOverTime produced 0 samples
2020-03-11 12:43:39,889 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.FilterConsumer#stopProducing(): nameFilter produced 405 samples
2020-03-11 12:43:39,890 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.FilterConsumer#stopProducing(): dateRangeFilter produced 81 samples
2020-03-11 12:43:39,890 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.NormalizerSampleConsumer#stopProducing(): normalizer produced 27 samples
2020-03-11 12:43:39,891 INFO o.a.j.r.p.CsvFileSampleSource: produce(): 27 samples produced in 226ms on channel 0
2020-03-11 12:43:39,891 INFO o.a.j.r.d.ReportGenerator: Exporting data using exporter:'html' of className:'org.apache.jmeter.report.dashboard.HtmlTemplateExporter'
2020-03-11 12:43:39,894 INFO o.a.j.r.d.HtmlTemplateExporter: Will generate dashboard in folder: C:\Users\DEV.WeiH\Desktop\Performance_Testing\Results\UI_MyProtection_FST_SFLogin-ASB_SI_1
2020-03-11 12:43:40,065 INFO o.a.j.r.d.HtmlTemplateExporter: Report will be generated in: C:\Users\DEV.WeiH\Desktop\Performance_Testing\Results\UI_MyProtection_FST_SFLogin-ASB_SI_1, creating folder structure
2020-03-11 12:43:41,704 INFO o.a.j.JMeter: Dashboard generated